app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "4353"], ["room_number", 0], ["created_at", "2021-07-01 07:06:24.209113"], ["updated_at", "2021-07-01 07:06:24.209113"]]